[
    {
        "timestamp": "gm scott — 12/22/2023 1:05 PM",
        "chapters": [{
                "title":"The Bounty",
                "content": "An emergency struck the town of Taerk Torrek in the continent of Ensonya. a couple dozen bounty hunters were summoned to the main hall of the royal castle, and the gates around were shut immediately, sealing the area. A dwarf with fiery red hair, Jebediah Ironfist, addressed the crowd of bounty hunters, announcing that the prince is dead and the killer is on the loose. Daring travelers and adventurers among the crows, but only three men and one woman raised their hands as volunteers after learning the severity of this issue. Zelutig 'The Uncut' Stonecock, Ipsaelth Gelordio, and Zyntripetal Force all set off to find the perpetrator with Jebediah. They made their way through a prison and a few different rooms, fought a zombie and found remnants of necromancy. Making their way into a secret room connected to the King's quarters, they find a necroflayer who was wearing an illusory disguise that looked like the King and was preparing the prince for a ritual of some kind. The party managed to slay this necroflayer and saved the prince. They were compensated handsomely for this great achievement."
            },
            {
                "title":"Necromancers! Mind Flayers! Gods! Oh My!",
                "content":"In the realm of Ensonya, a daring party of adventurers embarked on a journey that would lead them to unforeseen challenges and treasures. Their quest began in the regal Taer Torrek royal tavern, where they shared a drink with the prince himself. In the tavern, they met Astrid, a valiant royal guard and paladin, and the prince introduced them to Durkin Firestride, the castle's esteemed historian and a charismatic Tiefling Bard. Setting off from Taer Torrek, the adventurers acquired a sturdy horse named Thunderhoof and a reliable buggy for their travels. Along the trade routes, they discovered essential camp supplies. Their path took them northward, where they eventually arrived at the Village Commons. In the Village Commons, Zyntripetal Force made a life-changing decision by accepting the god Susano and donning powerful gauntlets extracted from a temple. The party also gathered a wealth of information from the local tavern, hearing tales of travelers and learning about a troublesome local goblin camp that regularly stole resources. Their heroic actions, including bringing back the goblin leader Gralk's head, earned them the favor of the tavern master and a place to stay. The adventurers discovered news of a mysterious traveler from the northwest and an enigmatic tower in the east, piquing their curiosity. In their pursuit of adventure, they journeyed to the Western Goblin Camp, challenging Gralk to a drinking contest with high stakes. With the help of their camaraderie, Zelutig won the contest, and the party set out to return with Gralk, but a grim fate awaited the goblin leader."
            },
            {
                "title": "Into the Fog",
                "content": "Continuing through the Village eastward, the party stumbled upon the Ancient Watchtower, an enigmatic structure surrounded by a menacing necrocurse, learning of its peculiar behavior in relation to gravity and space, and uncovered a valuable rod after solving a puzzle and slaying a mimic. Exploring further, they discovered a hidden hatch leading to an old safehouse. Descending into the cellar of the Ancient Watchtower, they found that the necrocurse did not extend into this underground refuge. Durkin recognized it as one of the fabled safehouses scattered across the dangerous No Man's Land. In the cellar, an intriguing book, the 'Necromancy of Thay,' captured their attention. A heated competition for the book ensued, culminating in Ip reading through much of it before it sealed itself shut. As the adventure concluded, Durkin serenaded the party with a song, leaving them with a sense of accomplishment and the echoes of Jaskier Pankratz, a familiar bard. In the world of Ensonya, their journey was far from over, as new mysteries and challenges awaited these intrepid adventurers."
            },
            {
                "title": "A New Direction",
                "content": "The party decimated an Orc camp and recruited the goblins that were there, sending them back to their long lost bretherin in the west. During the events of this decimation, Ipsaleth summoned Tymora's Coin and a skittish gnome appeared in the spell's radiance sphere, gripping a spellbook. The gnome's name is Woli and the party would come to discover over time that he was summoned from an ice temple somewhere in the northeast as he was to obtain as much knowledge as possible in a quest to free the Ice Goddess, Sonya. The party ventured through treacherous dungeons and met friends and foes working their way through the central parts of Ensonya, and the necrocurse. After making acquaintances with a small Drow village protected by a woman named Velindra Zethar, they made way to a labyrinth that, to their surprise, was home to lesser necroflayers and one greater necroflayer. Slaying their foes and solving a puzzle that unlocked a great door that was sealed with an Arcane Lock, they heard an eerie voice that lay beyond the darkness..."
            },
            {
                "title": "Uncovering The Past",
                "content":"Upon entering the dark room, Zelutig and Woli were swallowed by a massive black serpent and the party began fighting the beast immediately. After slaying the beast, the party looted some scales and teeth off of its corpse and questioned it while also using animal speaking. They found out that this is not ordinary or wild serpent, it is actually someone's pet, and it was originally at some outpost in the southeast. Amidst the action, Ipsaleth summoned Velindra via Tymora's Coin and a past relationship was revealed between Velindra and the man they came to know was Eldrithan, the same man who was trapped in this beast's lair, protected by a tiny hut spell. Sending these two on their way, the party ventured forth to a set of Trials they learned are the Ice Trials. They bested each trial and obtained artifacts that were clearly associated with the lost Ice Goddess, Sonya. After completing all of the trials, the party ventured back to Taer Torrek, backtracking a tenday or two of adventuring."
            },
            {
                "title":"Returning Home",
                "content": "Upon arriving to Taer Torrek in the late morning, Zelutig immediately made way to his favorite tavern, Ironliver's Pub, and began to run up a tab with his newfound riches. Zelutig and Dak'tul Ironhart (bartender) go way back. Astrid was called into the castle to report what they had been up to, but took their time and sought to relax in the pub with Zel. Woli and Durkin began performing for crowds in the town square under the gazebo. Durkin playing his lute and singing, seducing every passerby; and Woli doing his best jig and interpretive dance. Ipsaleth and Zyn had other ideas though - they set out to obtain new wares. In the first shop, they found new clothes and potions, in the second shop, they found new weapons. The second shop proved to be more noteworthy as it's owner, Thoren Ironhart, was a member of some weapons smuggling organization and had rare magic items in the back. Zyn and Ip bought two of these rare, magic weapons and received a 20% discount. They were told to go to the bar across town for more magic items.  Before heading over to the bar, the pair desired to seek answers to a cursed text, The Necromancy of Thay, which Ipsaleth has been carrying for more than a tenday. Successfully deceiving the guards at the wizard's tower of the Arcane Quarter's, they found themselves in some kind of training area on the first floor covered inwer vibrant flos and young mages performing restoration spells. Eventually finding their way to the second floor with some clever persuasion, and crafty use of their newfound potions and powers, they acquainted themselves with the elders in the library. A female Gnome, and Male Half-Orc, both with greyed hair, low hanging glasses, and sharing the same mannerisms, eventually directed them to a secret room connected to the library that housed the more powerful books that while may hold great power, also carry great curses. Ipsaleth dispelled an arcane lock and read The Annals of Karsus. He learned of The Orb of Karsus, The Scepter of Karsus, and The Crown of Karsus and how Karsus ascended to godhood, then imploded into trillions of strands of corrupted weave, leaving behind the shadow weave, made of netherese magic, just as the artifacts. Seraphina Elderspire blinked into the room and was clearly a powerful wizard, Ipsaleth had come all this way to talk to her, so she entertained the conversation, especially after seeing him read the Annals of Karsus and show the Half-Orc the Thayan text. She gave him the Thacarite Codex that embued his mind with the ability to open the book one last time. He opened the book, rolled an 18, next page - rolled a 20, next page - rolled a 28. And it was finally done - Ipsaleth had obtained the deeply forbidden knowledge of Necromancy and gained new abilities. He initially did not want to make the deal proposed by Seraphina to purchase his book for 1500gp, but eventually he decided to take the deal. Zyntripetal Force was seeking knowledge as well. He ventured into the library looking for books on Tyr in the Gods of Justice section. He came across a book that taught him of devotions to Tyr and how seeking his judgement is the goal of his followers. This was not what he was looking for - eventually he found a book titled: Balance in Imbalance: Teachings of Tiamat and Susano. This book was of a very different nature, and in contrast to Tyr's teachings of order, justice, and balance. Susano and Tiamat beleive in chaotic nature, albeit they reside on different ends, so they speak of disorder, chaos, and destruction. They believe to properly bring order, you must destroy and begin anew. Bring as much chaos into a system as possible and the natural entropy will bring about a better system once the dust has settled. Zyntripetal was also reading thunder magic for dummies. After taking in all of this knowledge, both of these adventurers found themselves in the same pub that the party had been drinking in all this time. They found the bartender the weaponsmith had told them of and questioned him about magical weapons. After he recognized them as the adventurers on the posters he was happy to show them his forged weapons and stashed items. They cleared out his inventory. Truly spreading the wealth in Taer Torrek. The party now begins their night in the pub, after enjoying a long day of shopping, performing, learning, and drinking."
            },
            {
                "title":"To The Mountains",
                "content":"Hastily departing from the tavern, the party set out to the mountains despite Durkin and Zyn's desires to head to the northwest. They first detoured and stopped by the goblin camp. They met Brok, who was revealed to be the new leader of the goblins and also a crafty poet. Getting back to the trail, the party embarked towards the mountains. Upon getting close to the foot of the mountain, Ipsaleth noticed a mysterious figure in the distance. This person was revealed to be an avatar of Vecna and nearly wiped out our intrepid adventurers; but alas, the party prevailed and slayed the avatar. As the avatar was sucked into an ethereal void, the party made one last attempt to get a hold of it's corpse. Zyn and Zel both got a hold of opposite ends of a sheathed sword, Zyn being on the hilt end, he pulled out an unexpectedly longsword that pulled him to the ground with it's weight. Upong further inspection, the party discovers that this sword is, in fact, the Sword of Kas. Recognizing the ancient eldritch runes, Ipsaleth warns the party of the power of this blade, but just as the rest of the party did, he also asked if he could carry it. Zyn, despite not planning to wield the blade in combat, insisted on carrying it during travels. Making their way up the mountain, the party finds themselves in a snow-covered refugee-esque settlement full of Dwarves: majority mountain dwarves, some hill dwarves, and minority mixed dwarves. The architecture here is dwarven, but minimal, and clearly a close-knit community of hard-working people. Walking directly into the building in the center of the town, the party finds themselves in a tavern, which is also their Town Hall. Gorr the barkeep made acquaintances with the travelers and directed them towards the Inn on the west end of town, run by Darwin, if they are looking for a place to stay the night. Making their way's one by one, each party member found their way to bed. Awaking to a new day in Ensonya, the party immediately began intimidating, ridiculing, berating, and persuading Darwin the Innkeep because they had discovered he had some ancient family heirlooms that could be useful on their journey - and as logic demands, the party must obtain them. Gaining access to two new items, Ipsaleth stashed a Dwarven Star Ruby and a Dwarven Emberheart Pendant. Knowing there are 6 more items to get out of this poor, pushover of a dwarf, the party notes the information and sets off to the north, heading into an area heavily obscured by the mountains ahead of them. Arriving at the first plateau of many to come, Zyntripetal gets a gut feeling that Zelutig should give Sonya's Wrist Wraps to Woli, thinking that it may help them figure out where to go next. Woli puts them on, and then levitates for a brief moment, glows a radiant blue and receives a vision from Sonya where she showed him the chains holding her, what the ice temple looks like, how it can be opened with the artifacts he carries, and why her imprisonment 1000+ years ago made this place so vulnerable. After some conversations about this, the details are noted and potential plans are devised. Now ready to embark to the Ice Temple the party  heads forward; but first, recognizes this area, it is the outskirts of Azwyr'flin, a long-standing Dwarven city; however, it looks very different than they have seen it in depictions. Not many venture this far to the City of Frostfall in modern Ensonya, and much has happened since the Taer Torrek family arrived back in  200AGS. Delving directly into the city outskirts, Ipsaleth, dawning the various pieces of Dwarven gear he has acquired along this journey, begets the attention of the first dwarf he sees walking around, as there are many to choose from in this area. Sparking conversations about the 'Highest Peak in Ensonya' and various other things, the party acquires new information on where they are, and what lies ahead. Now knowing that there are 3 different mountaintops that people debate are the 'highest' peaks; the party wants to seek out the nearest one and get to the bottom of this Ice Goddess mystery. Following the device of the friendly dwarf they met, they head into the market square and notice three distinct buildings: 'Apothecary & General Supplies', 'Weapons and Equipment', 'Town Hall.' Heading directly into the Apothecary, Ipsaleth and Zyn scope out the place while the party hangs back. They began to spark a conversation with the one human, older woman, seemingly running the place. There are other dwarves, a half-orc, and a dragonborn also in the shop. Successful persuasion from Ip and intimidation provided by Zel, the party discovers a backroom with strong potions that have extreme effects. Not liking the deals she proposed at first, the party asks if there is anything she needs directly that they could promise in return for 4 of these potions. She, Granny Martha, likes the sound of a deal. Martha proceeds to tell them of a Tiefling girl, who also lives at the 'Highest Point in Ensonya', which she wishes to take in as an 'apprentice.'* They are directed to a trail that heads up the highest mountain they could see after arriving to Azwyr'flin. The harsh cold is only getting harsher as they climb the mountain. Ipsaleth also has a locate creature spell active during this trek, on the girl, Zephryn. He knows the direction of the girl, upwards and to the west, but she is far more than 1000 feet away therefore he does know her actual location. Ipsaleth notes that as he takes steps upwards, he feels slightly closer, but steps taken purely horizontal or to lower ground in any direction feels further away. Getting very close to the peak of this mountain, the party senses an incoming ambush. Zyn notices it first, Ipsaleth doesnt notice anyhting off, Zelutig notices the ambush and also sees ice trolls and a frost giant ahead, and Astrid notices the ambush and the ice trolls. Preparing for a fight by enlarging Zel and having him take position on some elevation, Ipsaleth walks up to the frost giant. Attempting to find common ground, Ipsaleth learns that this brute is a follower of Vecna and is guarding whatever lies beyond by his order. The party decimates the enemies that lie before them. One by one each ice troll fell, the frost giant was stunlocked and received a 'Randy Orton' from the top rope by Zelutig, followed by a lightning bolt from the valiant monk-sorcerer Zyntripetal Force that burned him into a fine ash. Upon their defeat, the party found a few new things on their bodies, and a contract that said this brutish party of frost-peoples were also looking for Granny Martha's apprentice."
            }]
    },
    {
        "timestamp":"gm scott — 12/29/2023 3:10 AM",
        "chapters": [
            {
                "title": "The Highest Point in Ensonya",
                "content":"Venturing beyond the arena they fought in, the party found themselves at the peak of the Azwyr'flin Mountaintop. Ipsaleth and Zyn notice a peculiar figure standing at the edge of the summit, a large humanoid covered in feathers but bearing heavy armor as well. Approaching this figure with hesitation, the party was resplendent with the revelation that this male Aracokra was a friendly traveler, Bartholomew Beakfolk. Bart, an enthusiastic fellow, was willing to give the party a ride using his extremely powerful flight powers in exchange for magical wooden items, such as enchanted sticks, and magical bark. Ipsaleth used his planar ally to call in a favor and got some sussur bark from a minion along with a bag of other enchanted woods and kindling. Bart accepted this offer and assembled the party in a V formation, and after succeeding the required strength saving throws, the party found themselves at the bottom of the river of the main island of the Sky Islands, realizing quickly this was the lost druid's grove that was fabled to have existed where the royal farmlands now is. The strength throws were for passing through the spherical, protective, wind shield that gives this area it's name - The Impenetrable Fog;however, when traveling with a member of the grove they are protected with Sylvanus' Blessing that allows for 1-throw entry, and 2 fails are required to get knocked into the wind. Traveling without a member means making more throws, depending on the scenario. 2-Throw = Moderate Attempt, 3-Throw = Hard Attempt, 4-Throw = Extreme Attempt, 5-Throw = Suicidal Attempt. Scouting the area and asking Bartholomew what they were around, they realize they are just down the river from town hall and mayoral quarters. Walking over to it they notice many small creatures prancing around, a very bright and polarizing contrast from the necrocursed lands they know below them. The hut in the center of this area shines with a dim light, and the party walks in to see three people sitting at a Japanese-style dinner table, cross-legged on the ground. One in the center is another large Aracokra, Thistle the Wise, the Mayor of the Sky Islands. He has a commanding, but calming presence, and a deep shaking voice. There is a Tiefling-Elf, and Human in the room as well. The party speaks with Thistle and declares him a non-threat, and potentially an asset of an ally to have moving forward. Also in this conversation they realize they can give Thistle the enchanted woods to build them a boat that allows them to go upstream. Thistle also notifies the party that the combination of magic woods used resulted in a Wild Magic Canoe, and as he said, 'In the best of times, and the worst of times, unexpected behaviors may arise.' The party uses this canoe to go upstream to the next settlement on the island. They discover what seems to be a village of halflings and gnomes. The person they walked up to initially was not happy with the state of this place, but as they ventured into the tavern they discover it is a rather normal area but the townspeople seem to have motivations that lie outside of the overall grove's. The leader they talk with informs them that they do recruitment business and offer services for combat, assassinations, and scouting. They made acquaintances and moved on. Next the party found themselves at a cave just upstream. Ipsaleth and Zyn's godlike perception sensed a whole group of kobolds awaiting on the other side of the cave's opening. Instead of demolishing them in an instant, the party opted for the stratagem of conversation. Discovering that these kobolds actually guard their queen dragon, Sylvara Stormscale, the party finds a way to get the kobold leader, the aussie, to show them the way down into her lair. After a long walk down, the party discovers a resting adult bronze dragon, in all of its glory, they ask it a few questions. Zyntripetal discovers more about the connection between Susano and Tiamat, and the truth of 'Balance in Imbalance' and how furthering the connection with Tiamat from here is what is left to find out how this duo of divine connections can be used to bring justice to Tyr. Learning of a prophecy from this dragon that lowly adventurers would come looking for the key to the ice temple in the grove one day, the party questions the dragon a little more and trades some more information for the soul of Zyntripetal Force. Although this dragon is a lawful good, it clearly has some odd uses for life extension with the use of fresh souls, and returning the donor with a dragonborn soul. Zyn obtained a new permanent status effect of Bronze Dragonsoul Attunement. The party finds themselves at Zephryn's place and make acquaintances. Zeph seems to know exactly of the party, like she has been waiting for this moment for a very long time. She is very up front with how happy she is that they are not here for the hag, or for the necromancers, but is here for the ice goddess - the one hope she has in this mess. She shares the nursery rhyme of this prophecy that was left on her as a kid along with the key to the ice temple, it reads: 'In unlikely arrival, their destiny ordained, Balance they'll restore, knowledge unchained. Watch the waters with hope's silent plea, Sages of yore, unlocking what's meant to be. 'They discussed some of the moons earlier and decided to head to one, the dangerous one nobody wants to go to. They quickly discovered there was a serpent slithering around in the water in this steamy oasis. The party destroyed the 240 HP beast - Zelutig rolling 4 crits in 2 turns, Zyn landing hardcore lightning damage, Woli landing some as well, Astrid brandishing divine smites, and Ipsaleth successfully giving the serpent crippling illness of seizures all led to a decimation of the serpent before it could even attack the party. Finding some interesting loot on this serpent, inclduing a corpse and some special items, the party spots some eggs and a treasure chest also in the area. Zelutig pockets all four of the serpent eggs. The party distributes the loot found in the chest, which included a set of serpent armor, a serpent sight gem, and other magical items. After the last of it was picked up, Zephryn suggested the party make their way to the nearest Inn back on the main island."
            }
        ]

    },
    {
        "timestamp":"gm scott — 01/5/2024 1:58 AM",
        "chapters": [
            {
                "title":"The Tempest's Dragonborn Ascendant",
                "content": "The party decided to stay on the moon that housed the serpent and inspect the eggs that Zelutig had found. Zelutig graciously gifted an egg to each of his original party-mates, and each of them attuned with their eggs taking a short rest on this moon. Prepared for more adventure, Zyntripetal announced that he was feeling some serious energy flowing through his celestial arms. He had an inkling that the name of this sky island, 'Tempest's Reach,' may have something to do with his god, Susano. Upon announcing this, Bartholomew immediately announced that there was something he had to show him. He couldn't believe he did not know Zyn was the monk of Susano foretold to come here to reunite the dragons of the sky islands. After learning this information, Zyn felt it was prescient that they attend to this, and convinced the party to diverge from the previous path and let Bart lead the way. Following Bart back to the mainland, the party found themselves in an empty grove filled with overgrown foliage and fluttering butterflies. Ipsaleth shouted out, 'This? It's so inconspicuous.' and Bart responded with, 'Just please, close your eyes with me. You will see.' Upon all closing their eyes and accepting this ritual, the illusion of this area dropped - and a temple was revealed amongst the overgrowth. Bart looked to Zyn and Zyn, without hesitation, walked in without the party. The party slowly followed behind, Ipsaleth running in a little faster than the rest. Through the doorway the party sees a large and open lobby with some contraption in the middle of the room. Upon inspection, the party finds out that this is a magical lightning rod of sorts. It is meant to concentrate celestial and draconic power, and if the being driving the flow of this power manages to successfully load up the machine, they can then attempt to absorb the power. The party discovers that this is very unstable magic, and excellent execution of this ritual would be needed to actually achieve the ascension. Zyn says he knows this is what he is meant to do. After a long series of challenges against his dexterity, he proved worthy and found himself projected outside of his body, in a new place, but nowhere at all? Is this the Astral Plane? Is this death? Zyn doesnt know, but he hears a voice ask him, 'Are you ready?' to which Zyn makes clear, 'I can only be ready.' Now imbued with an amber tinted magic in his left arm, Zyn returned to his body and felt a new warmth, a new feeling of power that he has not known before. He is now the dragonborn ascendant of Susano, a long foretold hero of the sky islands - but can he live up to the legend?"
            },
            {
                "title":"RED Team",
                "content":"After watching all of this happen, the party was stunned, but excited for what was to come next. With the many new powers and allies on their side, they were sure to be able to take on anyone they need to, to finish their many quests. Bart pointed out that there is a secret tavern/safehouse in the back of this temple and there are probably some people there who would love to hear this news. The party, looking for a good time, went along with Bart to this backroom tavern. Walking through the doors, Thistle and Elystria are visibly seated, having a good time relaxing. Bart and Zyn broke the news, and Thistle starting pleading to Zyn that he must reunite the dragons of the sky islands, as apparently that is the quest of the foretold hero, other than protecting the land of course. After much divulging of what it means to bear this title, Thistle showed everyone to a nice night at the tavern with lots of Ale. A drinking competition ensued between many people and Zelutig managed to come out on top, winning 1,000GP. Thistle then inquired to the party, asking what they call themselves. They weren'y sure, they hadn't put much consideration into something like that. But on the spot now, they came up with an acronym - Relentless Eternal Defenders, RED Team. Although Durkin suggested The Reckless Five, Zelutig was not a fan of that and poured ale all over Durkin. Accepting the new RED Team name, Durkin put on a short show and the party took a long rest in the beds that Thistle showed them to. Awaking to a new day on the Sky Islands, the party took Bart's offer to fly them down to the mountain range right before the creche. Before flying down though, their eggs started to hatch. Everyone's eggs hatched into little elemental serpents. Zelutig's was the only one that seemed to have legs. With the eggs hatched and little serpent boys stowed away, the party made their way to ground, at the mouth of this valley heading through the mountains. Bart was very quick to turn tail and leave, but Zyn inquired on what made him so worried about this area. Apparently, the last messenger who went to this mountain never came back. RED Team didn't care, they pushed on. Confident. Now pressing through the valley, the party notices a dark figure lurking in the distance. It seems to be moving aimlessly and without real direction, but staying in the shadows. Approaching closer, the party was tactical about this and used all of their tools to immobilize this humanoid and dispel of whatever magic was making him so mindless and nonverbal. Dispelling the magic, a tadpole started to bulge out of his eye socket. It seems magic of some sort is responsible for keeping this parasite in this persons head. Ipsaleth summons his planar ally, giving him the task of extracting this tadpole, they pull it out with no issues and go on their way. With the tadpole extracted, the green color in this Githyanki's skin slowly came back and the dark complexion faded away. Making acquaintances with this Githyanki, he was revealed to be Sel'Thar Shadowstride, a prince of Gith nobility who was exiled after becoming a thrall to the Red Wizards. Being able to relate to this, the party trusted him after considering killing him, and had him lead the way back to the creche they were seeking out. Arriving at the creche, RED team did not see anyone, which was odd. This are should be bustling? but there is nobody to be found. Using locate creature, Ipsaleth got the direction of Eldrithan and the party quickly rushed into action. Eventally finding their way to a large royal meeting room that had the dome shattered by a large bronze dragon, the party burst into a battle. They were surprised to see Velindra, Eldrithan, and another Githyanki Warrior fighting this dragon, but eventually they were able to best the foe, ending with a necrotic blast of magic from Ipsaleth."
            }
        ]
    },
    {
        "timestamp": "gm scott — 01/12/2024 1:21 PM",
        "chapters": [
            {
                "title":"Under The Creche",
                "content": "Following the death of an adult bronze dragon, Eldrithan, the new Githyanki warrior they have come across, Kral'gathar, and Velindra were more than thankful for the suprise assistance. If it were not for the party's interference, and more specifically Ipsaleth's immense clerical powers of healing, they would surely have become smoking piles of ash and bone. Ipsaleth struck up a conversation with Kral'gathar, asking him who he is, why he is here, and how long he has been here. It is revealed to the RED Team that this creche has been a haven of safety for a millennia for Gith. Being that it is a hatchery, a training ground, and a large open air living quarters for all Gith who come to Ensonya, it is an extremely locked down area controlled and patrolled by one of the mightiest militaries of the land, with Kral'gathar as their fearless general, no less. Amidst this conversation, Kral'gathar takes notice of Sel'thar and his timely return to the creche after 6 years of exile. Intrigued, Kral'gathar poses a question, 'You dare show your face here, what are you doing back in the creche, Ghaik! Explain yourself!' Sel'thar explains that he is purified thanks to these travelers, his memory is hazy but he has deep remorse for any undesired circumstances that have befallen unto the Githyanki due to his actions; specifically, the deal with the Red Wizards... Kral'gathar was immeditaley taken aback by Sel'thar's composure and realizes that he is himself again, the Sel'thar he knew from a decade past. He is not ready to trust him, but feel he can trust his company. Now that acquaintances have been made, Kral'gathar inquires about how they ended up here? Zyn steps in to answer, explaining that they, but mainly he, was sent here by the king of dragons, Tiamat, and his partner in Elemental Chaos, Susano. Shuttering at the mention of this god, Kral'gathar hesitatingly asks, '... You're the Monk?' To which, Zyn confidently confirms. Kral'gathar believed this prophecy to be a myth a this point. What could the tempest god and king of dragons possibly have foresaw this many years in advance? Regardless of his uncertainty, he is not one to refuse the commands of the gods, and informs RED Team that there is a Wyrm's nest below the creche but following Sel'thar's incident it has been closed off to a strict group of riders and the dragons themselves. It has been roughly 3 years since Kral'gathar went into the caves below the creche, but he insists they march forth to the Wyrm's nest deep into the caves. Prepared to venture forth, the party heads through some courtyards seeing many Gith emerge from their humble abodes, recruits rushing into the royal meeting room to repair the roof the dragon had smashed through, and realizing that despite the previous commotion this is a thriving and self sufficient society isolated behind the western mountain range of Ensonya. As everyone enters the mind shaft to descend into the caves, Eldrithan became an annoyance and would not stop talking about how he has nobody left for him other than Velindra. Zyn made sure he knew he had a tendency to drone on about his life of loss."
            },
            {
                "title":"Lady of Loss",
                "content":"The cave is dark and dimly lit with a clear pathway that heads into the mouth of a cave. There are some obstructions and ramps in the room made of different rock formations and old mining materials, and the party senses uncertainty in the air of what awaits them ahead. Ipsaleth and Astrid both take notice of an ambush and make it known to the party. Preparing for whatever lies beyond the stalagmites, the party magically empowers themselves and shouts out for whoever is here to reveal themselves or they will do it for them. From around the centered, tallest stalagmite, a half-orc, half-goliath male standing at 7 feet tall cackles and excitingly proclaims that they dont stand a chance. Zyn reveals their quest for reuniting the dragons of Ensonya which quickly engrages this man, prompting him to announce that these dragons dont belong to them anymore. Refusing to let this evil-doer continue their unknown carnage, RED Team engages in combat with the foe and his half-dozen zombie minions. RED Team swiftly took care of this man, isolating him from his minions and forcing him to his knees to beg for his life. Amidst the plea deal to become an informant for RED Team, Astrid made it apparent that her sword revealed to her that this is a creature of darkness who must be disposed of, body and soul. Astrid has resisted the commands of the sword before, but this time was different. Astrid knew there was more to this foe. He was more than some bounty hunter sent by the red wizards, more than a lieutenant left to watch over their operations down here, no, he was one of Lord Vecna's zealots who would surely return stronger if they let him go. He was not to be trusted, and destroying his body and soul, here and now, are the only way to ensure the her adventuring mates would not need to endure unnecessary loss down the road. While some in the party considered what happened next to be unnecessary loss, they chose to not interfere with Astrid's holy calling. Astrid, looking into the eyes of the enemy, recites the wish spell granted to her by Shar, her darkness, and Lady of Loss. 'I wish for you to be undone, in body and soul.' The sounds of unspeakable horrors and unbearable pleasures fill the air as a kaleidoscopal pattern washes over reality and in a flash of darkness, where Astrid and the foe once stood lay footprints in the graveled sand. Ipsaleth attempts to pick up a trace of her being, and finds nothing. Not even his strongest connections with necromancy were able to contact or sense a spirit of someone once living. Everyone remaining in this cave feels a tingle down their spine and a pit of loss in their chest. They may not know what was prevented, but they are more than aware of what they have lost. Where Astrid went, and the true demise of the foe are seemingly mysteries to the party. All they know is what Astrid told them would happen when she utilized this holy item before she was strong enough to weild it. Durkin breaks the silence in the cave and stands on a ramp, exlaiming that despite the unforunte events, they need to keep heads held high and move forward into this cave. Zyntripetal agrees and urges the group to follow along. Emerging from the other end of this cave's mouth, they enter a large room with many stable-like rooms and a center tower with a large flat top. With some good perception, the party notices there is a sleeping dragon atop the tower. A very large, golden, shimmering dragon. Dispelling magic on the dragon, the eyes flutter and the dragon's breathing becomes audible where before it was silent. Sel'thar has an idea to throw a piece of gold up to the top of the tower as it could subtley wake the dragon. He was correct; the dragon heard the clanging of gold and it slowly  brought his eyes open, and eventually unto Sel'thar. This great golden dragon demands to know who this person is, and that if they have come to take his children they are already too late. Sel'thar explains why they are there, making it clear they do not mean to cause the dragon any harm and if anyhting, they have a common enemy. Willing to hear more from these mortals, the dragon turns it's attention to the rest of the party. Zyn then delves into his quest for reunification, prompting a worrisome but delighted response from the golden dragon, Soranu the Wise. Soranu makes it clear that a call from Tiamat is a call that cannot be ignored and that this prophecy coming to fruition now leaves many questions to be answered. Soranu has a deep and extensive knowledge of the separation war and the necromancers in the southeast, but himself cannot take them on alone due to the immense necrotic energy and many, many enthralled defenders. Soranu also has some old friends in the Eastern mountains who are responsible for creating the spells that kept the necrocurse from spreading to the mountains around 350 AGS. Revealing this information to the party, they were excited to: 1. Have a ride (they left their horse at Azwyr'flin). and 2. Potentially find a protection against the necrocurse. Before heading out, Zyn became curious if the dragon was sitting on any useful weapons, armor, or magical items that could aid in their adventure. Soranu whips around the nest with his long body, picking up some of his most prized posessions and dropping them down before the party. After inspecting and storing the items, RED Team climbed atop the Soranu's back and rode across the continent to a neighboring settlement of Azwyr'flin. Sending Soranu back on his way, the party now set out to find the wizard 'Eldric 'Gran Daño' Frotforge', an older dwarven wizard. Looking into the courtyard, the party see a group of dwarves getting into a shouting match with another group of dwarves. One red haired dwarf shouted out, 'Thorin! Ye great pain, are ye tryin to get us killed!' It became apparent that this was no screaming match, but an internal struggle to keep their friend from starting commotion. Amidst yelling at each other, the other dwarves walked off and the party stepped up to this group, asking if they had heard of a man similar to the wizard they set out for. The same red haired dwarf shouted over to his white haired friend, 'Eldirc! Theyre lookin for ya.' To which, @Astrid “Eldric”  responded. Hastily inquiring about his ability to create a protection spell that protects against the necrocurse he quickly responds that he does in fact know how to make a potion that can protect an individual and the spell that protected the mountains was more like a one-time ritual that just stopped the spread and repelled it from spreading to the feet of the mountains."
            }
        ]
        
    },
    {
        "timestamp":"gm scott — 01/19/2024 7:36 PM",
        "chapters": [
            {
                "title":"Milk and Cereal: Part One",
                "content": "RED Team sits down with the band of dwarves to discuss what to do next, what ingredients are needed to create this potion of necrotic protection and where they may be able to find them. Ipsaleth and Zyntripetal remember that they had met a Hag not too long ago, posing as an elderly woman by the name of Granny Martha. She ran an apothecary back in Azwyr'flin, which is pretty convenient considering that Thunderhoof and their magically protected buggy are awaiting their retrieval at the foot of the Azwyr peak. Ipsaleth inquired the band of dwarves if they could offer them safe passage as not having transportation now was quite the hinderance. During struck a deal, and Ipsaleth persuaded him for a discount. After going over some plans and getting everyone on the same page about the ingredients: Moonshade Petals and Hemlock Roots, which were soon denoted as Milk and Cereal, the RED Team set out towards Azwyr'flin, departing from Azwyr'harek. Zelutig expressed his boredom in this quest and refused to be an errand boy. Zelutig ventured off into Azwyr'flin on his own, likely to a tavern, but his true whereabouts are unknown. Upon their arrival, the dwarves went on their way and let the party know they can be found in the royal district of Azwyr'flin, specifically at a tavern called The Drunken Foot. The town is much busier than before. It seems the week they spent traveling between the sky isalnds and the creche, something has happened in further mountain ranges that have caused mass migrations into the Azwyr mountains. Overlooking the mountain range northwest of Azwyr, Gran Dano pointed out the Wiker mountain range, saying he sometimes stays in different cabins throughout the mountain ranges and he hasnt been the his Wiker cabin in a while. Enjoying good conversation while making their way through the town, the party found themsleves back at the Awzyr Apothecary. Just as last time, Granny Martha stands at the main desk, a dwarf and dragonborn working, sorting cleaning. But this time, a new face lurks in the back of the building. A male drow with silvery hair and black clothing, eerily waiting in silence in the back of the store. The drow did not seem to take notice of the party, nor did it seem to mind their actions of zone of truth-ing Martha and interrogating her about what she truly wanted from, or with, Zephryn. Martha was vauge, alluding to the fact that everyone is making dels with the necromancers these days, and her actions are should be the least of their worries, in fact, they should consider joining her ranks. In a turn of events, Martha asks Ipsaleth to join her in her office before cackling and preparing a spell of her own. In a green puff of spores, Martha disappeared and a door leading below the store swung wide open. Ipsaleth, Sel'thar, Zyntripetal, and Gran Daño quickly turn attention to this Drow, who seems rather undisturbed by this woman who is clearly a hag. The drow, Nadaal, introduces themself as a mere traveler, working here in between other jobs. He has seen a lot, and this hag doesn't bother him. Letting it slide for now, the party decides to get a closer look at the staff of this shop. It became clear that all of the workers outside of this drow are under some kind of charm, performing a loop of activities to seem as if they are working, for gods knows how long... Ipsaleth dispels the magic on the dragonborn and persuades him to carry the lantern down into what is likely the Hag's office as he should want revenge more than anyone. As they descend down into this dark, humid, and damp dungeon of an office, the party prepares themselves for a fight; however - Nadaal lurks behind the group, waiting in the shadows. Entering the office the party sees a reflective pool in the center of a Hag's lair, and Granny Martha standing a safe distance in the back of the room. Ipsaleth demands answers from Martha, answers she doesnt want to give him. As she begins to grow increasingly weary, Ipsaelth tosses his coin and Tymora blessed the party with an interesting twist of fate this time. Her capricious coin summoned a serpent oddly similar to the one the party slayed to save Eldrithan from the reflective pool, but as it emerged the coin zipped to the second floor balcony in the room and from the radiant sphere emerged a mysterious figure. A dark skinned elven-looking humanoid with red glowing eyes and fine robes of a master of the arcane arts. With the stage set, combat was initiated between the two parties and after a short battle, the party held Martha within an inch of her life to continue more questioning."
            },
            {
                "title":"Milk and Cereal: Part Two",
                "content":"Zyn attempts to make a deal with the hag, getting her to pluck out her eye and give to him as a peace offering. He had more conditions and after asking a few questions, Martha found a brief moment to use her spore step once again, but this time a ripple in the reflective pool was noticed as she popped into nothingness. The mysterious man muttered 'Running? Pathetic.' and walked through a portal that he closed just as quickly as he opened. This left the party alone in the hag's lair, which was bountiful in lotions and potions, as well as conveniently having the Milk and Cereal that Gran Dano said the party needed, amongst other herbs within the lair. While everyone is rummaging, Zyntripetal has a rather inquisitive urge to adorn his crown of cosmic insight and expend its charge of true seeing that allows him to see and project into the Ethereal Plane, and potentially project/sense into the Astral Plane. After exercising the power of the crown, Zyntripetal was able to see an empty landscape and a single workbench atop a mound of dirt, wit the hag hastily shoving things into a sack from the top of the table. Still bloodied, she was vulnerable but separated from the party by a pool of planeshifting. Ipsaleth sent a zombie through the pool to see its skin scorched by a radiant like fire, something about undead and ethereal plane doesnt seem to mix well, at least here. Taking a leap of faith, the party leap in one by one and upon entering they feel weightless, and breathless, only enough exygen fill their lungs to suffice for two rounds inside of this plane. Fortunately, they made quick work of the Hag when she refused to hand over every last thing in the sack and they made it out as the last ounce of air left their bodies. With new loot in their bags, the party was very curious about this Drow who seemed to still be lurking behind them, not really doing much, his presence began to confuse them. Things weren't adding up. They were able to get a relative truth out of him, find out that this entire time he has been working with her to obtain the same ingredients they were looking for. He still did not have a very clear reason, but it was enough for the party to see him as a non-threat, and perhaps useful as a means to an end. With this new knowledge, the party further questioned Nadaal into finding out that he had some allies coming later that day for a pickup of some of the finished potions of necrotic slumber, and were able to convince him to pose for an ambush on his allies. To which he quickly accepted, despite it being the only option to save his life, gong through with it would quickly prove his untrustworthiness to his new allies. As hours pass and typical patrons come in and out, the sun starts to set and two men in fine red robes enter the store. Nadaal perks up, it becomes obvious that these are his fellow followers of whatever it is he does. Nadaal was uncooperative, annoying people he called friends for the last few years, and stabbing one clean in the neck with no warning. The rest of the party jumps out, very shocked by this, they attempt to keep the stabbed man alive as they were intending on getting information out of him. The second acolyte jumps back to the doorway which they entered and says, 'What in the hells Nadaal!? HE will not forget this! In HIS name!' and dissapeared in a puff of smoke. The party was not concerned with the escapee, and put all attention on this wounded acolyte. Keeping him alive, getting info out of him, then Nadaal stabbing him again, pulling the knife down from neck to navel and turning his innards to outards. The man was barley hanging on as Ipsaleth healed him one final time to divulge more information on who is in the southeast, why are there people migrating, and what is the weakness of the necromancers? Nadaal did not have patience to hear the answers to these questions and ended his fellow acolyte's life. Finally, with the new information they have obtained, new allies made, and ingredients gathered - the party ventures back to Gran Dano's cabin in Azwyr'harek and make camp for the night as he prepares all of the potions he can with the 35 stacks of each ingredient. Making 17 total potions of Dano's Necrotic Resistance that each last 2 hours and provide double resistance (75%) to necrotic damage. 1 stack of each ingredient remains."
            }
        ]
    },
    {
        "timestamp":"gm scott — 01/26/2024 2:49 AM",
        "chapters": [
            {
                "title":"Secrets of the Farms",
                "content":"After awaking to a new day in Ensonya, RED Team acquires a boon of 17 necrotic repulsion potions through Gran Dano's brewing techniques and began discussing where they wish to go next. They analyze the surrounding area, recognizing the other mountain ranges, but an old itch resurfaced amongst the party - the desire to search the houses of the Royal Farmlands. Zyntripetal made a solo trip out there a few months ago and was able to see from a distance that some dark fog was seeping through a window and all of the crops in the eastern farmland being dead. The western farmland was vibrant and springing with plant life. Some deliberation ensues, and the RED team decided it was time to finally finish the investigation at the royal farmlands. Setting out in that direction with their recently recuperated horse, Thunderhoof, it took a good 16 hours from sunrise to get all the way there, but going back a time zone they manage to arrive around sunset. They come to a fork in the road and decide to head eastward, arriving at the luscious landscape of the royal farmlands. A quick investigation of the area reveals a male Elf wearing Torrekian Royal Robes managing a group of workers in Torrekian working garb. The RED Team introduced themselves the the Elf, Ipsaleth and Zyntripetal quickly striking conversation about the elven island. Making acquaintances, more pressing questions were necessary to be asked. The RED Team inquired about the western farms, the Elf said that a few months back he got a notice that the western farms were considered a hazard zone now and not to go over there. Royal scouts have only been out there a few times but he knows that the man who ran it is said to have passed, but has not gone into the hazard area. The party was very curious if the Elf knew of any brothels in Ensonya. He points out two that he knows of: Vanessa's Caress (in Taer Torrek), and Pocket Pleasure Palace (Northeast Coast, halfling/gnome village).  Armed with this important knowledge, the party felt ready to head to the western farmlands. Arriving at them after traveling a bit west, our intrepid adventurers perceive a necrotic presence inside of the building. Withering plants, the smell of death, and a light black fog seeping from a window, it was clear that this wood cabin was a bit abnormal. Kicking the door into an dusty explosion of splinters and decaying wood the party inspects further into a fog that is reminiscent of the necrocurse but seems lighter, and is radiating from the body of a corpse that is nearly decayed to bones, but rotted flesh still contains vital organs. As our cleric of luck and death does, Ipsaleth speaks with the corpse to reveal that there is more to this house: a hatch, his belongings, and a poison planted on him causing this necrotic aura. Ipsaleth promptly dispelled the magic, getting rid of the aura, and directed the party towards the hatch in the far corner under a bed. Entering through the hatch, a basement is revealed that has much more in it, but looks ransacked months ago. Fiurther inspection into the cellar, Zyn and Selthar discover a dead body that is less decomposed, but almost seems to be gurgling and has an enlarged brain bulging out of the back of its head. Recognizing the danger immediatley, Zelutig tosses his serpent at the back of the brain of the corpse, telling it to feed, dealing some immediate piercing damage, and corrupting the transformation process as well, causing the result of the transformation to be a more grotesque and rotted flesh version of a necroflayer. The party initially begins hearing out the necroflayer, being informed of how an illithid army was raised from the sea by the red wizards after they got here and that is how necroflayers even came to exist. Getting some information out of him about the southeast outpost, this necroflayer immediately connected with the hive mind, but it's presence being fresh is not fully connected to its Elder Brain. It has a day before more illithid start looking for him, and says he will bring them power and allies if they let him return to the outpost. Sel'thar doesn't like this, he swings his rapier and connects with the neck of the necroflayer. He gets an inch deep before the necroflayer is ale to use a misty step to get out of range. Keeping his head, for now, the necroflayer was ready to take on the entire RED Team in order to make it to salvation. But aslas, the necroflayer met their demise swiftly by the hands of the Sel'thar, splitting his brain in two."
            }
        ]
    },
    {
        "timestamp": "gm scott — 02/01/2024 2:52 PM",
        "chapters": [
            {
                "title": "Chosen by Chance",
                "content": "As silence broke across the room with the brains of a necroflayer spilling unto the floor, the party reconvened and found their way into the locked steel door towards the back of the room. A thorough inspection of this cozy secret bunker revealed a log book with large anonymous orders for milk and cereal around 6-7 months ago based off of orders above and below it, among plenty of other normal crops. RED Team's investigative abilities helped them deduce that their was something nefarious going on - and they speculate that it is coming from within the castle. Upon leaving the bunker, they found a pristine staff of revitalization and made their way out, mostly ignoring the necroflayer corpse because there did not seem to be anything special about it. While walking out of the house and recuperating, preparing to make their ways to the Wïker mountain range, Ipsaleth decided to toss his capricious coin. Forming a strong connection, and tossing the coin, it envelops the entire party and turns their skies black. Tymora, in her golden and radiant form, appears before the party towering over the, solid gold clanging and ringing as she leans in closer to them. Silence has never been this obstructing to flow of their thoughts. Words come into Ipsaleth's mind with an ethereal sting down his spine but the golden lips on tymora's face don't move: 'Are you worthy?', to which Ipsaelth responds that he beleives he is. 'This is your last chance.', she speaks into his soul, as the skies of darkness recede and Tymora fades into nothing. The RED Team is shaken, but not stirred, and appears in the dead center of the Thayan Outpost in the southeat, deeply in the thick smog of the necrocurse. Fortunately, Thunderhoof was transported with them and a base resistance while inside of the buggy was provided. Surveying the area, Ipsaleth and Sel'thar recognize the area in terms of geographical location, making it known where they think they are. The party quickly finds refuge in a safe pocket on the edge of the area that seems to have a slightly thinner smog. While making haste to this spot, Ip Sel and Zel had an idea. They felt they could successfully disguise themselves and get into one of the buildings at an outpost to potentially learn more about the Thayans and a way to take them down. The trio armed with disguise kits, acolyte robes, and a physical presence that is similar to Thayans, head into the building to discover it is a tavern. The musk in the air is more similar to that of Orcs than humans, but the music is pretty good, instead of typical bard tunes they are darker, pounding beats and whining stringed instruments that pierce your ears and turn your heart into a war drum. Delving into the tavern, they make their way to a table and seem to blend in so far. Ipsaleth goes to the barkeep and asks for some ale, but notes that he is new around here, deceiving the barkeep into thinking that he has come from the mountains and brings with him new recruits for the cause. The barkeep buys it and gives them some free booze. After throwing some drinks back they go back to the barkeep and ask him if they have any milk and cereal around here. Recognizing the robes, the barkeep says that they dont get much of it but they do have a recent shipment in the back. Ipsaleth demands to be shown and manages to deceive the barkeep into letting him and the rest of the trio back to the stockpile. In talking about the ingredients, the party learns that they can be combined and with a touch of necrotic energy, it creates a necrotic goo that melts through organic material and ages anything containing life essence 10 years per second of contact up to 10,000 years. Forging documentation that they have orders from Szass Tam to commandeer 20 stacks of milk and cereal, Sel'thar managed to trick the barkeep into giving them all of their stockpile. The barkeep is very unhappy about this, begs and pleads to keep some but alas, the party exits with their newly acquired ingredients.     Desperately needing somewhere to take refuge, the RED Team scouts around the desolate landscape and identifies a hobbit hole in the side of one of the hills taht seems like a standard Thayan home. The RED team immediately barges in as soon as they can, being the dead of night they seemingly get in with nobody noticing. A male goliath and a female Thayan were alone in this home, one the man in his study and the woman tending to her plants. The party knew they had to murder these people, but they did not want to. These are casualties of war in their eyes. The man started to get angry as they began addressing his wife and as a magical essence appeared around him, Ipsaleth cast blight and hit the man incredibly hard. Zyn then stepped to the side of the woman and shot a lightning bolt at both, striking both for massive damage. The rest of the fight carried out swiftly, as they were unarmored civilians in their home completely unprepared for a fight. Murderous rampages, deceitful actions, and unfortunate consequences aside - the RED Team has found refuge and commandeered a cozy home nestled in the middle of the Thayan badlands. As night creeps, the party is scrambling to figure out a way out of the area. They consider the options in ransacking and leaving or sleeping in the home now and decide making camp here to sleep is in their best interests."
            }
        ]
    },
    {
        "timestamp":"gm scott — 02/08/2024 2:42 AM",
        "chapters": [
            {
                "title":"WHO?",
                "content": "Awaking to a new day in Ensonya, the RED Team finds themselves in the home they slept in within the Thayan Outpost. They continued to loot the place, noting all of the information they got out of the map and books in the building, but one thing they forgot - cleaning their tracks behind them. The RED Team opened the door, with Zelutig still asleep, to see that there were roughly a dozen Thayans, accompanied by a familiar face (or so he thinks), waiting for them to awake. With food in hand and startled by this, they quickly head back inside, but Zyntripetal quickly made a call to the skies for Soranu and as thunder crackled and storm clouds took form, he turned with the rest of the party. Fortunately, the sturdy wooden door swung open and out emerged the Goliath, Zelutig. Now all awake, they feel confident in taking on this dozen or so foes, so they proudly step back into action and strike conversation with the dark skinned man standing in the middle of the Thayans. Zyntripetal kept him entertained, constantly denying he knew who he was. This was Scjauron, the man they ran into a handful of times before. Once at the fight with the Hag, and another time when Zyntripetal was given his dragon riding boots, and yet again when Ipsaleth scryed on him. Zyn's insistence on not knowing him seemed to really annoy him, and he kept getting denied when bringing up times he had for-sure come into contact with them. Stalling for long enough, Soranu appeared over the horizon, soaring through the storming clouds and tapping into Zyn's mind, asking him to direct him on what to do. Zyn commanded Soranu to perch above them and allow for people to get on, as well as himself, making use of his dragon riding boots for the first time since receiving them. Assuming position to fight, Zyn commanded Soarnu to make a loop around and use his flame breath, as he goes to do this, Scjuaron signaled for the supreme necroflayer to summon the rest of the necrotic illithids waiting in the distance, roughly 2.5 more dozen of them. As the flame breath is being charged, Scjauron drops a globe of invulnerability and the woman in the red robes next to him shouts out, 'You will pay for what you did to my sister!' The party endured one of the most uneven fights they could have ever imagined, taking large chunks of damage and barley overcoming conditions instilled upon them left and right. Counterspells stopping Zyn from displaying their full power, a Wall of Fire decimating the health of Gran Dano and Ipsaleth, Zelutig's cock missing it's strikes, and Sel'thar's height advantage not providing the advantage he desired - RED Team was outclassed and outnumbered. Blade barriers, unarmed strikes, freezing spheres, and a plethora of other attacks were displayed to no avail, only removing so many necroflayers from the battlefield. Slaying a couple thayans and more necroflayers later, the party recognizes that the tides are not in their favor and Zyn commands Soranu to prepare for an escape plan and makes a dive back towards the spellcasters of the party to offer them an exit. On the other side of the battlefield, Sel'thar was making sneak attacks and executing the beasts sicked on them by the Thayans. Sel'thar came across an interesting item on the Worg that was making attacks with an oddly-shaped crossbow, this crossbow bore the body of a lute, but has attachments that make it a hand crossbow as well. Using his stealth to his advantage, Sel'thar managed to keep himself safe from other foes after eliminating his targets. Gran Dano tapped into his arcane power and conjured a 60-foot-wide explosive sphere of ice and descended it upon the half of the battlefield containing the most Thayans and not hitting any teammates, eliminating a Thayan mage and some more necroflayers. Finally, Soranu was on the move again, making his way across the battlefield picking up the rest of the party, barley grabbing Sel'thar on his way out, gripping Soranu's massive talons. While making their way back, Zyntripetal was quick to pose questions to the party. Realizing that there is much more at stake here than what they previously thought. Woli, seemingly harmless, seemingly nothing more than a sage who has been brought into the wrong journey, but he was used as a bargaining chip by the mysterious man, Scjauron? 'Why?' wondered Zyn, and the others seem to not have much a clue either. Woli speaks on it for the first time, clearly shaken by this, he is coming to grips with the fact that there is some latent power within him that he doesnt know about. There is something that Scjauron knows that he doesn't and it is driving him crazy. Scjuaron was able to evaporate Woli's spellbook, withering his connection to Sonya down to the artifacts he wears and what remains of her divine essence, at the snap of a finger when tapping into Woli's power and siphoning him through some kind of abjuration magic. These matters were to discuss another time as for now, they had to find safety. Bloodied, burnt, bruised, and beaten, the RED Team was fortunate to make it out without losing anyone, even Soranu took his fair share of damage. They agreed the best course of action was to seek out the Goliath village they think to have discovered in the Thayan's home, so they set out in that direction and rested atop Soranu's back as he glade into the mountains. Upon arrival, Soranu made it known he would head back to the Tempest's Reach and he will need time to rest, and his duties at the Reach may prove more demanding after seeing what they are up against. The party made their way into the village ahead of them, seeing many Goliaths for the first time since witnessing some immigrating into Azwyr'flin. They approach a welcome center across the bridge into the town and find out that there is a brothel right ahead, as is customary in Goliath culture. Upon stepping into the brothel they are met with smells and sounds of music and moans unlike any they had experienced in their travels. This crowded brothel, in the early hours of the evening, was a display of Goliath leisure - admiration of physical excellence. Deciding to make themselves comfortable, they sit at one of the only open tables in the house, right next to a small table occupied by a dwarf and a large Goliath. Curious was the feeling overcoming Zelutig, he felt an urge to speak to this Goliath, so he made acquaintance and when he shared his last name, Stonecock, the large goliath stood up at a towering 8 foot 4 inches, and demanded that Zelutig pull his loin cloth to the side. Zel complies. The larger Goliath embraces him dearly and reveals himself as the great Grakka Stonecock, owner of the finest brothel chain in the Ahran region, and father to the Cenique'kadan, the chosen son, Zelutig. They catch up and discuss other pressing matters such as the rogue goliaths that plague the village and other parts of the Ahran region as well as myths and stories of an ancient temple at the highest point in the Lordak region. As night began the creep, the RED Team was allotted a place to stay in some of the VIP rooms within the brothel, finally making their way to rest after a rather treacherous day."
            }
        ]
    },
    {
        "timestamp": "",
        "chapters": [
            {
                "title":"",
                "content": "Immediately following casting the Wish spell: Astrid finds herself in a spaceless space, surrounded by silence and bleak nothingness. she feels weightless, as she is nothing. she moves wherever she wants into an eternal void of the beyond, both flowing like water and standing like stone, she has achieved ultimate loss. An eternity passed in a moment Lady Shar spoke into her mind: You're welcome, my child. You made the most holy sacrifice, and rid the world of a vital messenger of Szass Tam. Your allies do not know it - but you saved them. Feelings of fulfillment, for the first time in decades, showered Astrid's being. A moment of bliss in an eternal purgatory, a bleak reward for such a feat, Astrid began to grow worried as Shar's presence started to fade. Was she going to be left here? Where is here? As Shar's presence faded into nothing, a faint chuckle could be heard as Astrid's body was returned to her and the land around her began to reveal itself. She knows where she is now. Astrid's soul was intercepted on it's way to Estelion (Sharran afterlife) by Shar and placed in the Shadowfell. As Astrid's body began to be encased in Dark Justiciar armor and the Spear of Night materializes in her hand from the surrounding astral essence - she hears Shar one more time, One final test, my child. There are intruders in the Shadowfell. Rid of them. Bring my reign back to this domain."
            }
        ]
    },
    {
        "timestamp":"gm scott — 02/15/2024 3:56 PM",
        "chapters": [
            {
                "title": "A Hero's Journey",
                "content":"Another day in Ensonya for the RED Team means another day full of adventure, illusion, deception, and action. Awaking amongst the goliaths, each member of the party was graced with dreams the night before and only a few of them found them pressing enough to discuss initially. Zyntripetal and Durkin were enjoying some tea early in the morning as everyone promptly shuffled into the brothel's lobby, where the party then held a discussion with with Grakka and Thrain about the ongoing rogue Goliath issue in the town. The party managed to persuade the two that they got a lead and heading out to where they are going would help put an end to the rogue issue faster than eradicating them as is. Ipsaelth uses his Danse Macabre to summon ghouls to assist Thrain and Grakka in protecting the town. With this compromise in effect, the party decides to make their way towards the Lordak region as all of the leads so far, ranging from Soranu's request when dropping them off to the dreams they had the night before, it seems like the ice temple they seek for Woli lies in the treacherous mountains of the northmost Lordak mountain, Lordak'nogaak. Making their way downhill, they spot an encampment sitting at the foot of the Lordak region. There are seemingly some Goliaths walking around, but as it is mid-day and the weather is horrible, there is not much to note, but they continue through the village nonetheless. Ip and Zelutig attempt to establish contact with one of the Goliaths and come to realize that they seem to be wandering around mindlessly. Intrigued, the party continues to investigate and tries to interact with more Goliaths; however, their ruckus alerted Draco Iflem, the Goliath Monk working for the Thayans and one of the main perpetrators in the rogue Goliath issue. The party did not know who he was at first, and as he was rather boisterous with a heavy Huttian accent, they could tell that he does not play nice. They devise through conversation that he would get more slaves and power from working with the Thayans, so as is tradition for RED Team, they initiated combat. Following a slugfest of mindless Goliaths throwing themselves at the RED Team, the party turned the tide and eviscerated Draco into a pool of rotten flesh, reuslting in all of the Goliaths to come to a stand-still, as the gauntlet on Darco's arm was acting as a remote control device to these Goliaths. The party decide to make camp at Draco's Encampment as there are now many empty homes open for commandeering. Following a long night of harsh weather and more dreams, the party awakes and they instantly started a discussion of how their dreams could connect. A statue, an open field of ice, and a spectral figure, and an ancient ritual. Connecting these to their old dreams, they knew the where and the what, and it was time to figure out the how. Starting their trek up the Lordak'nogaak, it is a steep, icy, and harsh climb. RED Team is fitted with many different capabilities that make this journey less treacherous. Making their way a good bit up this mountain, they come across a clearing and plateau. In this clearing, they can see a small wooden hut and a fire amongst the thick snow coming down. This is a desolate place outside of this hut, and the weather is not suitable for any man to make a home, so who could be here? if anyone? RED Team investigates with all of them surrounding them and cracking open the door, and as they open it up a bit out comes Bruce 'Roo' McSnout, 'Aye mates! G'day! Whatchall doin up eyah?' The party was overjoyed to see Bruce, but was very confused why he was here. He divulges that Sylvara can be a bit of an ass, so he likes to get away and come down here, and he likes the cold as he is actually one of the descendants of the ice dragons, and lastly he knows the stories about the ice dragon that might live here under an ice temple, but he has never seen such a temple around here. Discovering they have the same destination in mind they let him know he can join them on their way if he wants. Of course he does! Bruce tags along and shows them the path that heads upwards to the North since that is the direction that Ip's tattoo is still pointing. Going up this path there is a statue of the ice goddess standing amongst ruins and massive rocks. Ipsaleth recognizes the slots on the arm, hand, and neck that seem to accept Woli's artifacts of Sonya. Slotting them in results in a massive laser of radiant ice being uncovered and constructed with the parts of the statue in an automated and mechanical fashion. The weapon destroys a massive rock in front of it then shoots out over a half a mile in one direction and hitting an invisible bubble shield cloaking the area beneath it. This weapon rid of the barrier and revealed the long-forgotten Ice Temple. Woli instantly recognizes it, and Zyn recognizes a massive field of ice in front of them from his dreams. Gran Dano recognizes the magic in the protective illusion spell that could only be conjured via ritual. And lastly, as the party walks toward the temple and bumps into invisible wall of force, a voice cackles and reveals itself standing far in the distance, but using a spell to speak as if they are right next to the party - Scjauron, accompanied by a militia of necroflayers, has made it to the temple before them, and Zelutig recognizes the many enemies standing before him from his dream. During the party's time in Draco Iflem's encampment, they also ran into a leiutenant they had seen before at the Thayan outpost when engaging in a fight with Scjauron. The leiutenant originally was fighting with Draco but attempted to flee at the end of the fight. When Zyn and Ip got in a standoff over who would obtain the gauntlet on Draco's wrist, Zelutig decided to toss Woli at the leuitenant and with all of his might (and a really good roll) he nailed him in the head and knocked him out cold. Woli awaited for the rest of the party to come investigate and eventually when they did, they discovered that this leiutenant was more than meets the eye. Although he is seemingly a normal Thayan, he is dressed in finer garb than the usual soldier, and seemed to be well connected in comparison to people they have met before. They come to find out that this is James Marco Marco, son of a high ranking military officer in the Thayan military and he doesnt actually want to be in the military and provides fine uniforms and custom robes for many different militaries and groups around Ensonya, including the gnome and halfling village, fairies, Githyanki, and some of his designs seem to have even made their way to Taer Torrek. The party sees this as an opportunity and decides to make him a spy of sorts. They utilize a scrying spell to keep a constant watch on him, which he was willingly accepting of because he saw it as a way to be on camera all the time like a superstar. They decided to send him on his way to obtain as many resources as he could from the Thayan outpost so he could take them back to the goblin camp in the west and create them all new gear. When they tuned in to check on him, they saw him going through different materials and racks of leathers and metals, singing and dancing through the halls while collecting the necessary materials."
            }
        ]
    },
    {
        "timestamp":"gm scott — 02/22/2024 3:27 PM",
        "chapters": [
            {
                "title":"Now or Never",
                "content":"Standing before a familiar foe, the party had a brief period to deliberate what came next. Scjauron stood smirking across the courtyard of ice and watched as the RED Team went back and forth, seeming to get into private conversations behind each others backs - this was new for them, unlike their previous meetings with Scjauron where they stood together, unrelenting and ready to take him on. Scjauron took a seat and watched as he felt this was perfect, it was more beneficial to let this play out than to interfere. The RED Team managed to put together a plan, 'Bring the goblins, get the girl, kill the douche,' but it was lacking one thing: a mode of transportation. Fortunatley, Zyntripetal remembered his deep connection with dragons, and made a call out to Sylvara. The skies crackled and a rumble could be felt under the ice. Sylvara was nowhere to be seen but from under the ice lake, a spirit of a long-bodied dragon came bursting through and flying directly into Bruce McSnout's chest, creating a light storm of snow and giving him the ability to transform into an Adult Dragon (Frost). As Bruce was adamant on being a descendant of Thrymheim, it seems he is Thrymheim... now? So Zyn inquired, and Bruce said Thrymheim was an ancient dragon and it seems his soul is all that was left here, and removing the arcane dome shielding the temple must've allowed it to get out, and he must've chosen Bruce's soul as he recognized his kin. Bruce, with a much deeper voice, asks the party to get on his back and hold on tight and began to head in the direction of the goblin camp. Getting to the goblin camp, they meet back up with James Marco Marco who had created some interesting gear for them, very fashionable as well. He made robes of entanglement, boots of fireballs, hood of beheading, and finely crafted breastplate armor, specially tailored for Zelutig. The party was very happy with all of these new garments and was busy inspecting them. As Ipsaleth got down the line of items he arrived at the spot the robes of entanglement were at, to see they were no longer there. As he turned around, he sees Zelutig standing behind his band of goblins as they tossed the robes onto his body. Zelutig and his goblin posse seemed to have forgotten that they would need to attune to these items to give it an action word - so Ipsaleth had a moment to retaliate, but it was all for not as the goblins were then ordered to pin him down and hold him for questioning. The party begins to interrogate Ipsaleth, making it clear they know about the tadpole, they know he has been keeping the nexus stone a secret, and that his desire for power and usage of evil twisted magic could not supersede the mission that is eradicating the very evil he is starting to become. The back and forth got very intense as Ipsaleth could not come to any agreement in that the tadpole was nothing more than that: a necrotic touched tadpole. He wasn't going to beg, and he wasn't going to fight them, he wanted only to make it clear that he would rather die in pursuit of glory than live to back down from. Some more deliberation between Gran Dano, Zyn, and Zelutig ended with the decision that they were going to kill him. With a last second effort, Ip attempted to budge his hand out and wasn't able to quite get it done, seeing this Zyn grabbed his bag off of him as well. With the party standing over him, they made a last second call to flip the coin and see if they can summon Tymora and see what she thinks. Letting Ip up to toss the coin potentially one last time, he gives it a toss right into the center of everyone. The skies go black and everything they could previously hear, birds chirping, wood stairs creaking, fire crackling - all snuffed out in a void of vast nothingness. From far in the void a solid gold figure approaches them at inhuman speeds ultimately towering over them, this was Tymora, shimmering from unseen light. She calls out, looking directly at Ipsaleth 'Why have you called me here' To which Ipsaleth responded that the party has requested her presence to make final judgment on his life - during this, Zelutig spoke up out of turn and failed to resist the command to get into tornado drill position.  Tymora responds, 'My Chosen, what is to be judged' Ip relinquishes the conversation to Zyn, signaling to Tymora that Zyn was the one who holds the answer to that question. Tymora's large form shifts to look directly at Zyntripetal and allows him to speak. He says that they need to know if he is evil, can they trust him? She pauses for a moment, then proceeds: 'My chosen cannot be good nor evil for he is the embodiment of chance itself. Ipsaleth cannot commit to absolutes, in whichever direction they may lie. And to the worthiness of his trust - I can assure you that veering too far in either direction would have divine repercussions.' Stunned. The party was satisfied with her answers and in their brief moment of wonder, the plane of which they stood on thrust them at speeds faster than anything they have ever experienced back from her holiness and with that blast of force the void crumbles away and the party finds themselves back in the goblin camp, with a new plan. Deciding to let Ipsaleth live and get back up, there were still some things the party needed to do before they could move on. Zyn tossed the tadpole into a fire and it squeaked as it died. Zelutig pulled out his large legged serpent and took the serpent out of Ipsaleths bag, and following some rolls by the serpents, Zelutig's serpent devoured Ipsaleths. Zyn returned the bag to Ip, and Ip began to drink himself to sleep with all of the available brew in the camp. Further discussion of artifacts had to be canned for another time as they started to feel the urgency of the impending fight with Scjauron. Getting everyone together, including Brok and James Marco Marco, it was time to get the girl. The party flew up to Tempest's Reach and gathered more allies, informing them of what they found. Zephryn was overjoyed to come along, Thistle wanted to stay back to watch the Reach, Sylvara said he would swing by if needed, and Elystria said she had unfinished business at the ice temple. With these new allies in tow, it was now or never to finally take on Scjauron, any more delay could have unforeseen circumstances. A long flight allowed for strategizing, resting, and attuning for everyone aboard. Arriving at the place they took off they see Scjauron in a slightly different position, laying back on a bench with his coattails draped afront the seat, tossing an apple in the air and catching it. 'Finally here, aren't you? I was beginning to get worried you wouldn't come back.' The party met this cockiness with equivalent trash talk. Reminding him that he is nobody to them, no matter who he is, who he used to be, and especially not who he is trying to become. Stepping forward into the battlefield now, the party can see more than a dozen necroflayers waiting in the shadows behind rocks and in stiarwells, as well as Dorgrim Bonecleaver and a small collection of Thayan soldiers. There was not turning back now, the fight was on. A treacherous battle, playing out over the course of two minutes and six seconds, every member of this fight gave it their all, many dying, and members of the RED Team making it dangerously close to dropping before receiving healing. But the RED Team came out on top, taking only casualties in their goblin units but overall - managed to make it out alive. Next they turned to the thayans that remain and surrendered to the RED Team. There were some things the party had questions about, like the nexus stone. All of the Thayans kneeled and begged Ip to put the Nexus Stone away, but one person stood out. Dorgrim was visibly unaffected by whatever effect the Nexus Stone had on the other Thay. She shook her head and laughed, 'They have no idea what they have' She says under her breath. Zyn and Ip hear her, and in further questioning she continues to laugh, accepting her fate as slave or dead at this point. The party decides to fly her up as high as they could and drop her, splatting her body in the snow in front of her kin. The party now prepares for the temple that lay before them. "
            }
        ]
    },
    {
        "timestamp": "gm scott — 02/29/2024 3:47 AM",
        "chapters": [
            {
                "title": "The Ice Temple",
                "content":"The RED Team, standing victorious before the Ice Temple, now dealt with the aftermath of their arduous battle. Chained prisoners of war, remnants of Scjauron’s forces, awaited their fate. Swifter than the winds of Ensonya, the decisions were cast; the prisoners, along with the spoils of conflict, would be escorted by James Marco Marco and the dragon Bruce to the abandoned abode in the Royal Farmlands—a house once engulfed by a sinister fog. Murmurs of contemplation dissipated as the RED Team, now unfettered by looming threats, made their approach to the Ice Temple. Woli, guided as if by an invisible string, activated the entrance. The stone doors, laden with arcs of blue magic, parted to reveal passages veiled in eldritch twilight. Within the temple's embrace, three paths beckoned. The central door, locked away by unknown magics, and two winged doors, whispered promises of secrets. It was the owl statue that caught Ipsaleth’s studious gaze. His knowledge, paired with dice kissed by fortune's grace, unveiled its peaceful symbolism—a pet of divinity. Woli, ever impulsive, darted toward the library in the eastern chamber—a vault of memories and knowledge that was once his sanctuary. His joyous reunion birthed gifts: tomes of power and a codex on the nefarious 'V man,' now clutched by Ipsaleth. Magical texts and symbols, weaved in frost and lore, graced the party's collection. The western span of the temple held a different tale—a draconic remains of mammoth proportions. Hints of a bygone era, a stable of celestial beasts, and draconic inscriptions suggested a coalition between Sonya and the majestic dragons. Once the dead of night settled its cloak over the temple, the party rested. However, Ipsaleth sought the silences of the library, with Zyn as his shadow. The night bore witness to Ipsaleth’s confession; his path diverged from the RED Team's unity. With solemn words and offerings left behind, he vanished by magic's whisper. Zyn, gripped by emotions raw and unguarded, found solace in slumber amidst tomes and scrolls after a failed attempt to stop Ip in midst of his recall. With dawn's light came renewal. Zyn, heavy with the gravity of Ipsaleth's departure, shared the truth with his comrades. Resolve strengthened in his absence; they’re a crew undeterred by the mysteries and perils that lay ahead. The central door, now yielding to the key in their possession, opened. The meeting with Kaelen Silverveil, Paladin of stoic mien clad in resplendent armor, revealed their shared goals. A candid exchange and assertions of integrity earned the Paladin's trust. The Paladin inquired on how they got in, as the only way in is with the Frostheart, otherwise they would be intruders. It became evident that someone in this party must be the Frostheart for the doors opened for them. As our paladin is astute in his beleifs, he recounted that this is as written and he will assure the delivery of the frostheart to the frostsoul path. With his storied tenets as their guide, they progressed further into the temple’s enigmatic depths. No sooner had they stepped through the portal that the veneer of tranquility shattered. The mocking voice of V man broke through, ushering the RED Team into his carefully woven snare—a prison betwixt dimensions, where only the planar savvy could tread. 'You think yourselves so smart, so clever, when all you've done is waltz so gracefully into my trap. Fortunate for you, I have more divine matters that need my attention. For now, lets see how you fare against one of my devilishly devious pets.' The desolate void revealed its warden; Malachar, the devil of administering torment, presented himself as a formidable obstacle. He along with his militia of Mephits cause a handful of causalities in the goblin army, but the team's collective might prevailed, eviscerating the overseer in a demonstration of their honed abilities and indomitable spirit. As silence returned to the penitentiary void, the party’s eyes rested upon the looming monolith before them—chains, heavy and cold, grasped tightly around the enigma they imprisoned. What secrets are beyond the iron and frost, they could only guess, but the resolve to uncover them burned bright amidst the snow-laden afterworld. The devil's defeat became a testament to the team's resolve and burgeoning might—yet their victory was overshadowed by the shackles and tomb that lay before them. The whispering winds seemed to mock their presence, carrying faint laughter. Now, as anticipation hovers like the breath of the gods themselves, the RED Team awaits the revelations that the shattering of these chains might bring in the sessions to come."
            }
        ]
    },
    {
        "timestamp": "gm scott — 3/07/2024 at 2:04 AM",
        "chapters": [
            {
                "title": "Party Atomics",
                "content":"Following their confrontation with the formidable Malachar, a direct contact of the dreaded Vecna, the RED Team successfully liberated the goddess Sonya from her tombing encasement using a barrage of fire spells. As the chains shattered, the goddess's divine presence flashed before them in ethereal splendor, only to dart away like a fleeting spirit. The party, alongside Zephryn, were swiftly transported back to their arrival room, where Zephryn informed them of her and Woli's secretive new divine purpose, intricately tied to the team's fate. Therefore she could sadly not share the details, but ensured them that they are on the path that leads to them conquering in an absolute win, and any intervention, ANY at all, would cause fate to bend and the party's outcomes do not look too great outside of this one. The RED Team, bound by trust and acceptance of the unknown, bid an emotional farewell and headed back to their base in the western farmlands after considering that they should gear up to the furthest degree before actually heading to the southeast and facing them head on. Amidst a bustling camp, they discovered their war prisoners industriously engaged by James Marco Marco in crafting weapons, while the general they sent was conspicuously absent. The insightful conversations with James led to the conception of formidable 'nukes' utilizing Gran Dano's Staff of the Magi and Zelutig's magical broom. James also hinted at a stockpile of additional supplies for smaller versions of this powerful arsenal that he could retrieve with the help of his Thayan workers. As the party tasked James to proceed with this strategic assembly, the introspective dragon Bruce imbibed heavily, clearly had a lot on his mind or nothing at all. After some probing, Bruce disclosed the existence of Astralos, a mythic dragon whose presence—or absence—could reshape the destiny of Ensonya. Astralos is believed to have been an ancient dragon more powerful than any they know today - a master of all elements, and anyone powerful enough to rid of him would have to be of a god-like status. The RED Team's return to Taer Torrek coincided with uncovering the heinous past of the city, which was built upon the genocide of dragonborn and stood over the sacred grounds of Greatwyrm's Rest. Kaelen, deeply troubled by this revelation, was driven to uncover more of this obscured history. Afterwards, Zelutig and Kaelen went to the vendor to buy and sell some gear, Zyn explored the Wizard's Tower, seeking clues to Ipsaleth's whereabouts and intentions, which were possibly linked to the Eye of Vecna. Seraphina, the potent wizard, expressed her dismay and resolve to aid the RED Team in their fateful endeavors. She felt duped by Ipsaleth and quickly became worried that his thirst for knowledge was actually a lust for power."
            },
            {
                "title":"Greatwyrm's Rest",
                "content":"Gran Dano's meditative attunement to an essence of Sonya's magic that he could sense at a pond in the city center, which revealed a concealed passage beneath the sacred waters. He informed the party of this when they all reconvened and while it sounded like a stretch, he was absolutley sure that there is something down there that Sonya is calling them to do, and the concealed passage emanates with the ice goddess's magic. It did not take much contemplation, the party dove into the pond, much to the astonishment of onlookers, and emerged in a chamber rich with draconic history and ties to Greatwyrm's Rest - passing through a mystic membrane of sorts. Landing in some kind of worship chamber, all tumbling down some kind of pedastal, the RED Team came across many collections of texts and signage that pointed to this not only being the ancient civilization of Kaelen's origin but also that they had a some kind of connection to Sonya as well as the other traditional dragon gods. In their expedition through the vestiges of this ancient civilization, the RED Team encountered the Supreme Necroflayer again, this time within the expansive cave network. This necroflayer was a remnant of their past, a wounded soldier from a previous fight with Scjauron - it is believed there are only a dozen Supreme Necroflayers within the Thayan army. They also managed to control a half dozen beasts, a mix of Worgs and Bugbears that await gnawing on bones around this section of the cave. The Necroflayer was poised to infiltrate Taer Torrek with his entourage of creatures, but the party's attempts at negotiation swiftly escalated into battle. Though victory was theirs, it was hard-won, depleting their resources and greatly wounding a a couple members of the party. In the aftermath, bruised but unbroken, Kaelen, Zyn, Zelutig, Gran Dano, and Durkin stood ready to venture further into the depths of Greatwyrm's Rest. Their journey promised to uncover the profound secrets of the ancient draconic society, the essence of Sonya's previous worship there, and what these insights could mean for their looming conflicts with the formidable forces arrayed against them."
            }
        ]
    },
    {
        "timestamp":"gm scott — 3/14/2024 at 2:04 PM",
        "chapters": [
            {
                "title":"The Depths",
                "content": "As the RED Team gathered around the lifeless form of the Supreme Necroflayer, Gran Dano's knowledgeable eyes pierced the surface of their foe's being, discerning secrets of these forsaken entities, which offered a more profound comprehension of the necrotic forces at play in Ensonya. Unlike the common Necroflayers—mindless automata impelled by necrotic larvae—this supreme variant lacked the telltale marks of Thayan dark magic and the phylactery-driven subservience. Gran Dano deduced with remarkable acuity, evidenced by a fortuitous roll, that these superior beings could indeed sever their bonds to the hive under extreme circumstances, much like the desperate rebel they had encountered in their subterranean skirmish. In the aftermath of battle, Kaelen and Zyntripetal's curiosity led them to the upper echelons of the caves, where they unearthed foul alchemical experiments. The concoction before them threatened to implode the very heart of Taer Torrek with its insidious mix. Gran Dano's arcane mastery perceived the imminent catastrophe—the formula before them was not merely deadly but apocalyptic in potential. But fate smiled upon them, as Zyn neutralized the threat, preserving both the city's innocence and the historical bedrock known as Greatwyrm's Rest from oblivion. A quick look around the area made it clear that Milk and Cereal are at play here, but not in the ways that they understood it to work. There were additional potions here that seemed to amplify or neutralize the effects of them when combined - whatever was being cooked here, it was going to be devastating and the RED Team proved yet again that they are in fact on the path of least resistance. If only they could ask Zephryn if the decisions they are making are the right ones. Further in the fungal labyrinth, the band encountered a myconid, its visage akin to a mush-capped samurai in silent contemplation thanks to keen perception of select party members. The bizarre entity, though slow with words and burdened by an otherworldly stillness, tacitly communicated an offer of truce, and a wisdom save later, granted Kaelen a conversation beyond the boundaries of ordinary understanding. In the heart of their oasis, the RED Team came face to face with Zethul and Mycellia, whose stature and reverence amongst their people underscored the gravity of their encounter. Surrounding the oasis was a small colony of Myconids and Dragonborn - many in their youth. Knowledge of a necromancer who passed through here 20 years ago could Conversing with Zethul was a rollercoaster. Kaelen was considered a traitor, defector, and coward but upon the explanation of Sonya granting him grace and protection, his noble service was respected and understood. Zyn on the other hand had questions pertaining to reuniting the dragons - which took Zethul by surprise and led him to a course of questions about the party, who is in it, is Zyn the dragonborn? Getting these answers, Zethul was much more willing to divulge information about Astralos and the prophecy. Astralos was believed to be in the sixth layer of the hells, trapped or imprisoned or being exploited somewhere by someone but most details are unknown. Clever thinking led Zyn to get his astral crown of insight out and attempt to see Astralos, knowing Astralos is likely on a different plane, this is going to be a long shot. Focusing intently on his goal, he hears a guttural and gravely voice say 'FOCUSSss' to which Zyn does not fight it at all. In a vision that is traveling at unfathomable speeds descending through each layer of the hells and eventually arriving in the sixth, a layer covered in dark volcanic rock and with large coliseum like structures separated by seas of flowing magma. A quick zoom into one of the structures and Zyn caught a glimpse of a dragon in a sort of slumber, coiled and covering the entire floor level of the coliseum. And in a flash the vision reversed and Zyn found himself back where he stood."
            },
            {
                "title":"The Calm",
                "content":"Back at their encampment, the discussion surrounding the encounter with Neopheles Nocturnam, a man shrouded in fine, red, rogues' linen yet not ignoble in bearing, showed up amidst the production of missiles and clasped the RED Team's thoughts in a vice of dread and enigma. James Marco Marco was found to be under some kind of spell and potentially even a scrying spell observing the camp once Gran Dano dispelled the magic around him. James then revealed the truth and cut past the lies in his head, the mysterious man in red: he didnt care about Thayans, asked if this was the RED Team hideout, recognized bags in the house from Scjauron's belongings, and clearly scorched off a piece of his coattails to use for scrying. Perplexed by these revelations the party was unsure how to proceed against an enemy that didnt leave any clear tracks, and seemingly has no ties to the foes throughout their journies. Nonetheless, RED Team told James Marco Marco to try to keep things on the low low as long as he could because they still had some things to take care of before committing to any launch times - they needed to seek out answers about the hells, dragons, and how this could help them against V man and the necromancers. In the annals of Taer Torrek's illustrious library, Durking presented a very old book: Ensonyian Atlas: A Geographical Interpretation of the Newland, 300 AGS which had page after page of overworld villages, colonies, towns, cities, and even nomadic tribes and the lands they roam. Eventually arriving at a page that said in large bold common letters: 'Depictions throughout the rest of the text are not guaranteed for accuracy and were created using an experimental technique of mapping utilizing the magic of sound.' thereafter the team uncovered detailed cartographic works—a veritable chronicle that charted the nerve-like networks of caves stretching as dark arteries beneath Ensonya's surface. These maps, in their revealing glory, beckoned to the adventurers as guides to the subterranean secrets that might sway the tide in their favor. Yet there was wisdom in waiting—to embark on further exploration with the unity of their full number. Kaelen also found Frost Magic 101: Woli's Guide to Everything which gifted him a small amount of additional power. Under the high arches of the Wizard’s Tower, Seraphina—the guardian of forgotten lore and arcane mysteries. With Zyntripetal at her side, they spoke of the journeys beyond the veil, of sacrificial rites needed to breach Hell's gates, and the search for elements imbued with the essence of damnation and redemption alike. The horn of a devil, the skull of a humanoid, and a blood diamond: these became the macabre keys to open pathways into horrors untold. Durkin was quick to realize that meant he was probably going to be losing a horn as Tieflings are all descendants of devils at the end of the day, Zyn suggested that the party retrieve Ip's skull to use in this ritual, and for a blood diamond - the party was informed that jewlers, places with immense treasure, and groups such as the dwarves are their best bet in finding one. Kaelen learned much of the tale of Ipsaleth, quickly understanding the unfortunate scenario the deceitful elf of the party's past has left them to bare and agreeing that they may need to bring him to justice. With this new knowledge and goals in mind, Zyn, Kaelen, and Durkin made thei way back to the royal library to sit around the campfire where their imbibed companions lay in rest. As the thread of twilight wove its tapestry across the city's ageless stone, Kaelen and Zyntripetal, amidst their scholarly respite, pondered the weight of history and the clouded future in the company of the mighty Seraphina. The present yielded to reflective thought, but the morrow—filled with the echoes of their past deeds and the untamed potential of prophecies—lay in wait for the RED Team, the relentless defenders of Ensonya's waning light."
            }
        ]
    }
]